BugQuest/wifi-radar/firmware/sdkconfig.defaults
# ===== Wifi Radar — sane defaults =====

# Target chip
CONFIG_IDF_TARGET="esp32"

# UART console — 921600 baud needed to keep up with sniff+CSI throughput
# without ringbuffer overflows.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=921600
CONFIG_ESP_CONSOLE_UART_BAUDRATE_921600=y

# Log level (info by default; we'll use our own JSON output channel)
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# ===== Wi-Fi CSI =====
CONFIG_ESP_WIFI_CSI_ENABLED=y

# ===== Wi-Fi stack tuning for sniffing + CSI =====
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=n
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=n

# ===== FreeRTOS =====
CONFIG_FREERTOS_HZ=1000

# ===== Misc =====
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
